##### DataFrame Class

In [1]:
import numpy as np
import pandas as pd

##### 생성

In [36]:
data = {
    "2015" : [9904312, 3448737, 2890451, 2466052],
    "2010" : [9631482, 3393191, 2632035, 2431774],
    "2005" : [9762546, 3512547, 2517680, 2456016],
    "2000" : [9853972, 3655347, 2466338, 2473990],
    "지역" : ["수도권", "경상권", "수도권", "경상권"],
}

columns = ["지역", "2015", "2010", "2005", "2000"]
index = ["서울", "부산", "인천", "대구"]

df = pd.DataFrame(data=data, index=index, columns=columns)
df

     지역     2015     2010     2005     2000
서울  수도권  9904312  9631482  9762546  9853972
부산  경상권  3448737  3393191  3512547  3655347
인천  수도권  2890451  2632035  2517680  2466338
대구  경상권  2466052  2431774  2456016  2473990

In [37]:
df["2010-2015 증가율(%)"] = (df["2015"] - df["2010"]).div(df["2010"]).round(4)
df

     지역     2015     2010     2005     2000  2010-2015 증가율(%)
서울  수도권  9904312  9631482  9762546  9853972            0.0283
부산  경상권  3448737  3393191  3512547  3655347            0.0164
인천  수도권  2890451  2632035  2517680  2466338            0.0982
대구  경상권  2466052  2431774  2456016  2473990            0.0141

In [38]:
df.지역.values

array(['수도권', '경상권', '수도권', '경상권'], dtype=object)

In [39]:
df['2015'].values

array([9904312, 3448737, 2890451, 2466052], dtype=int64)

In [40]:
df.columns

Index(['지역', '2015', '2010', '2005', '2000', '2010-2015 증가율(%)'], dtype='object')

In [41]:
df

     지역     2015     2010     2005     2000  2010-2015 증가율(%)
서울  수도권  9904312  9631482  9762546  9853972            0.0283
부산  경상권  3448737  3393191  3512547  3655347            0.0164
인천  수도권  2890451  2632035  2517680  2466338            0.0982
대구  경상권  2466052  2431774  2456016  2473990            0.0141

In [42]:
df.index.name = '도시'
df.columns.name = '특성'
df

특성   지역     2015     2010     2005     2000  2010-2015 증가율(%)
도시
서울  수도권  9904312  9631482  9762546  9853972            0.0283
부산  경상권  3448737  3393191  3512547  3655347            0.0164
인천  수도권  2890451  2632035  2517680  2466338            0.0982
대구  경상권  2466052  2431774  2456016  2473990            0.0141

In [43]:
df.T

도시                     서울       부산       인천       대구
특성
지역                    수도권      경상권      수도권      경상권
2015              9904312  3448737  2890451  2466052
2010              9631482  3393191  2632035  2431774
2005              9762546  3512547  2517680  2456016
2000              9853972  3655347  2466338  2473990
2010-2015 증가율(%)   0.0283   0.0164   0.0982   0.0141

In [44]:
df

특성   지역     2015     2010     2005     2000  2010-2015 증가율(%)
도시
서울  수도권  9904312  9631482  9762546  9853972            0.0283
부산  경상권  3448737  3393191  3512547  3655347            0.0164
인천  수도권  2890451  2632035  2517680  2466338            0.0982
대구  경상권  2466052  2431774  2456016  2473990            0.0141

##### 열데이터의 갱신, 추가, 삭제

In [45]:
df['2010-2015 증가율(%)'] = df['2010-2015 증가율(%)'].mul(100)
df

특성   지역     2015     2010     2005     2000  2010-2015 증가율(%)
도시
서울  수도권  9904312  9631482  9762546  9853972              2.83
부산  경상권  3448737  3393191  3512547  3655347              1.64
인천  수도권  2890451  2632035  2517680  2466338              9.82
대구  경상권  2466052  2431774  2456016  2473990              1.41

In [46]:
df['2020'] = [1,2,3,4]
df

특성   지역     2015     2010     2005     2000  2010-2015 증가율(%)  2020
도시
서울  수도권  9904312  9631482  9762546  9853972              2.83     1
부산  경상권  3448737  3393191  3512547  3655347              1.64     2
인천  수도권  2890451  2632035  2517680  2466338              9.82     3
대구  경상권  2466052  2431774  2456016  2473990              1.41     4

In [47]:
del df['2020']

In [48]:
df

특성   지역     2015     2010     2005     2000  2010-2015 증가율(%)
도시
서울  수도권  9904312  9631482  9762546  9853972              2.83
부산  경상권  3448737  3393191  3512547  3655347              1.64
인천  수도권  2890451  2632035  2517680  2466338              9.82
대구  경상권  2466052  2431774  2456016  2473990              1.41

##### 열인덱싱

In [49]:
df['지역']       # 결과는 Series

도시
서울    수도권
부산    경상권
인천    수도권
대구    경상권
Name: 지역, dtype: object

In [51]:
df[['지역', '2015']]     # 결과는 DataFrame

특성   지역     2015
도시
서울  수도권  9904312
부산  경상권  3448737
인천  수도권  2890451
대구  경상권  2466052

In [52]:
df[['지역']]         # 결과는 DataFrame

특성   지역
도시
서울  수도권
부산  경상권
인천  수도권
대구  경상권

In [53]:
type(df['지역']), type(df[['지역']])

(pandas.core.series.Series, pandas.core.frame.DataFrame)

##### 행 인덱싱

In [56]:
df[:'서울']      # df['서울']은 에러가 나온다

특성   지역     2015     2010     2005     2000  2010-2015 증가율(%)
도시
서울  수도권  9904312  9631482  9762546  9853972              2.83

In [57]:
df[1:2]

특성   지역     2015     2010     2005     2000  2010-2015 증가율(%)
도시
부산  경상권  3448737  3393191  3512547  3655347              1.64

In [59]:
df['부산':'인천']

특성   지역     2015     2010     2005     2000  2010-2015 증가율(%)
도시
부산  경상권  3448737  3393191  3512547  3655347              1.64
인천  수도권  2890451  2632035  2517680  2466338              9.82

In [61]:
df.head(3)

특성   지역     2015     2010     2005     2000  2010-2015 증가율(%)
도시
서울  수도권  9904312  9631482  9762546  9853972              2.83
부산  경상권  3448737  3393191  3512547  3655347              1.64
인천  수도권  2890451  2632035  2517680  2466338              9.82

##### 개별 데이터 인덱싱

##### df['열이름']['행이름']

In [62]:
df['2015']['서울'], df['2015'][0]

(9904312, 9904312)

##### 연습문제 4.1.3

In [79]:
data = {"국어":[80,90,70,30],
        "영어":[90,70,60,40],
        "수학":[90,60,80,70],
}
columns = ["국어","영어","수학"]
index = ["춘향","몽룡","향단","방자"]
df = pd.DataFrame(data=data, index=index, columns=columns)
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

In [80]:
# 1) 수학점수를 시리즈로
df['수학']

춘향    90
몽룡    60
향단    80
방자    70
Name: 수학, dtype: int64

In [81]:
# 2) 국어, 영어점수를 데이터프레임으로
df[['국어','영어']]

    국어  영어
춘향  80  90
몽룡  90  70
향단  70  60
방자  30  40

In [82]:
# 3) 평균을 새로운 열로 추가
df['평균'] = df.mean(axis=1).round(1)
df

    국어  영어  수학    평균
춘향  80  90  90  86.7
몽룡  90  70  60  73.3
향단  70  60  80  70.0
방자  30  40  70  46.7

In [83]:
# 4) 방자 영어점수를 80점으로 수정
del df['평균']
df.loc['방자','영어'] = 80
df['평균'] = df.mean(axis=1).round(1)
df

    국어  영어  수학    평균
춘향  80  90  90  86.7
몽룡  90  70  60  73.3
향단  70  60  80  70.0
방자  30  80  70  60.0

In [84]:
# 5) 춘향의 점수를 데이터프레임으로
df[:'춘향']

    국어  영어  수학    평균
춘향  80  90  90  86.7

In [85]:
df.head(1)

    국어  영어  수학    평균
춘향  80  90  90  86.7

In [87]:
df.T[['춘향']]

      춘향
국어  80.0
영어  90.0
수학  90.0
평균  86.7

In [88]:
# 중간에 있는 두행 꺼내오기
df.head(3).tail(2)

    국어  영어  수학    평균
몽룡  90  70  60  73.3
향단  70  60  80  70.0

In [90]:
# 6) 향단의 점수를 시리즈로
df.T['향단']

국어    70.0
영어    60.0
수학    80.0
평균    70.0
Name: 향단, dtype: float64

In [91]:
df['영어']['방자']

80